```console
% terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_location_place_index.name will be created
  + resource "awscc_location_place_index" "name" {
      + arn                       = (known after apply)
      + create_time               = (known after apply)
      + data_source               = "Esri"
      + data_source_configuration = {
        + intended_use = (known after apply)
      }
      + description               = (known after apply)
      + id                        = (known after apply)
      + index_arn                 = (known after apply)
      + index_name                = "location-service-1"
      + pricing_plan              = "RequestBasedUsage"
      + update_time               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

awscc_location_place_index.name: Creating...
awscc_location_place_index.name: Creation complete after 7s [id=location-service-1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```